In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
dict1={'Names':['ramesh','suresh',np.nan,'mahesh'],
      'Age':[31,32,33,np.nan],'City':[np.nan,'hyderabad','mumbai','chennai']}
data1=pd.DataFrame(dict1)
data1

    Names   Age       City
0  ramesh  31.0        NaN
1  suresh  32.0  hyderabad
2     NaN  33.0     mumbai
3  mahesh   NaN    chennai

In [6]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [7]:
data1.isnull().sum()
#every column has one missing value is there

Names    1
Age      1
City     1
dtype: int64

In [8]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [12]:
dict2={'Names':['ramesh','suresh',None,'mahesh'],
      'Age':[31,32,33,None],'City':[None,'hyderabad','mumbai','chennai']}

data2=pd.DataFrame(dict2)

data2

    Names   Age       City
0  ramesh  31.0       None
1  suresh  32.0  hyderabad
2    None  33.0     mumbai
3  mahesh   NaN    chennai

In [13]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [14]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [15]:
dict3={'Names':['ramesh','suresh','Null','mahesh'],
      'Age':[31,32,33,'Null'],'City':['Null','hyderabad','mumbai','chennai']}
pd.DataFrame(dict3)

    Names   Age       City
0  ramesh    31       Null
1  suresh    32  hyderabad
2    Null    33     mumbai
3  mahesh  Null    chennai

In [17]:
data3=pd.DataFrame(dict3)

In [22]:
data3.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [23]:
data3.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

In [20]:
data3.isnull().sum()/len(data3)

Names    0.0
Age      0.0
City     0.0
dtype: float64

**method-1**

> Fill the missing values with random number

>  dataframe name=data1
  
 > method name :fillna

In [24]:
data1.fillna(40)

    Names   Age       City
0  ramesh  31.0         40
1  suresh  32.0  hyderabad
2      40  33.0     mumbai
3  mahesh  40.0    chennai

> method 2

In [ ]:
fill the missing value

In [26]:
data1['Names'].fillna('Satish',inplace=True)
data1

    Names   Age       City
0  ramesh  31.0        NaN
1  suresh  32.0  hyderabad
2  Satish  33.0     mumbai
3  mahesh   NaN    chennai

In [ ]:
#create the data again
data1=pd.DataFrame(dict1)

In [ ]:
** Method --3**

bfill
ffill
pad
backfill

In [27]:
data1.fillna(method='backfill')
# names index 2 is missed value
#it will replace by index 3 value

#age index 3 is missed value
# we dnt have indx 4 ,so the value is NaN
#city index 0 has missed value
# it replace with index 1 value

    Names   Age       City
0  ramesh  31.0  hyderabad
1  suresh  32.0  hyderabad
2  Satish  33.0     mumbai
3  mahesh   NaN    chennai

In [28]:
data1.fillna(method='ffill')

    Names   Age       City
0  ramesh  31.0        NaN
1  suresh  32.0  hyderabad
2  Satish  33.0     mumbai
3  mahesh  33.0    chennai

In [29]:
data1.fillna(method='bfill')

    Names   Age       City
0  ramesh  31.0  hyderabad
1  suresh  32.0  hyderabad
2  Satish  33.0     mumbai
3  mahesh   NaN    chennai

* bfill and backfill both are same
* pad and ffill both are same

** method --4**

In [ ]:
--mean
--median
--mode

In [30]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [31]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# instead of providing a random number
# we re filling with mean of the data

In [32]:
age_median=data1['Age'].median()
age_median

32.0

In [33]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [35]:
age_mode=data1['Age'].mode()
age_mode
#data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [ ]:
#level1: mean median mode
# level2: bfill fill
#level 3:

**KNN**

**KNN imputer**

In [ ]:
KNN:k nearest neighbours
    in the knn imputer instead of taking mean of all the values
    will choose neighbours data
    will take those mean only

**KNN imputer**

In [ ]:
n_neighbors is parameter can choose by user
if we dont choose by default it will take as 5

In [38]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [37]:
data1

    Names   Age       City
0  ramesh  31.0        NaN
1  suresh  32.0  hyderabad
2  Satish  33.0     mumbai
3  mahesh   NaN    chennai

*method 6**

In [ ]:
#based on other columns
#some times all above methods will not provide good justification
#at thar time we need to check other columns dependency also
#most of time will pick a column which have highest correlation